export default function Article() {
    const postDesc = "רוב המשפחות אינן מצליחות לקיים שגרת ארוחות משפחתיות משותפות באופן עקבי, שלא נאמר בהנאה של כל הצדדים. ועל אחת כמה וכמה בתקופה הנוכחית. אז מה עושים כאשר מתקרב סוף השבוע בו מתוכננת ארוחה משפחתית או כל אירוע לא שגרתי אחר? איך צולחים אותה בהצלחה עם ילדים רגישים? דבר ראשון, חשוב לזכור שככל שאנו נשתף בידע שיש לנו על האירוע כך תיווצר תחושה של ידיעה והבנה לגבי האירוע ועל כן תתאפשר הכנה מתאימה. כאשר לנו אומרים שבעוד יומיים הולכים לארוחה אצל הסבתא או לחתונה או אפילו לטיול בחו”ל (מפנטזת) אנו מיד נדע מה לדמיין ונתחיל בראש מבלי לשים לב לתכנן ברגעי הפנאי שלנו מה נעשה, מה נביא, איך נתלבש, איך נגיע לשם, נחשוב על האוכל, על מצב הרוח שבו נהיה ועוד. אבל ילדים הם חסרי ניסיון חיים ולכן הם לא יודעים מה לדמיין, מה הולך להיות. הם יהיה שם אוכל שהם יאהבו או לא. האם יפגשו את בני הדודים? אם סבתא תרצה חיבוק ונשיקה או שצריך להתרחק בגלל הקורונה ואיפה יש מקום שקט יותר כשהכל מציף. והכי חשוב – הם אינם יודעים למה אנחנו מצפים מהם (גורם תסכול מספר 1)."
    const list = {
        title: "ארוחה משפחתית. איך עושים את זה?",
        items: [
            "לדבר! לספר לאן הולכים, מי יהיה שם, מה עושים, כמה זמן וכל מה שרלוונטי. תנסו לפרט בצורה ויזואלית כמה שיותר (שולחן אוכל עם מפה לבנה, כולם ישבו יחד ליד השולחן ואתה תשב לידי ואני אעזור לך לחתוך). חשוב לשים לב שהתוכן המפורט יכול להציף ילדים באם זה לא בקשב, כדאי לעודד אותם לסקרנות ואז לפרט.",
            "תיאום ציפיות – איך יושבים ליד השולחן- יש לי הגבהה, צלחת מיוחדת? מה קורה אם סיימתי לאכול? מותר לי לקום מהשולחן? לאן אפשר ללכת? האם מישהו צריך להיות איתי? כל משפחה פועלת אחרת ולכן אתם יודעים את התשובות. תכינו את הילדים, תשתפו אותם.",
            "מה יש לאכול? הציצו במטבח לפני הארוחה עם הילד והציגו לו את כל המאכלים (המיועדים לארוחה הזו, לא את הקורנפלקס!). שאלו אותו איזה מהמאכלים הוא אוהב ומה הוא ישמח לאכול. כדאי שיהיו לפחות שני דברים שהילד מסכים לאכול. ותרו על התנסויות וטעימות חדשות ‘בכוח’ בזמן ארוחה משותפת. יש לו מספיק דברים על הראש כרגע.",
            "אם הארוחה אצל משפחה או חברים – דאגו להגיע לשם לפני מועד הארוחה בכדי לאפשר לילד ‘להתחמם’ בסביבה, לראות מי נמצא, לשחק עם הילדים, להציץ על השולחן ועל האוכל מראש בכדי לאפשר לו להרגיש כמה שיותר בנוח.",
            "השפע על השולחן יכול להיצבע כעומס גדול מדי עבור הילד. ואם הילד הוא גם בררן מזון מאוד יכול להיות שיש מאכלים שהוא נגעל מהם וירצה שיהיו רחוקים ממנו. הכרתי ילד שלא היה יכול לשאת את המחשבה שעגבנייה תהיה איתו באותו שולחן.",
            "להימנע מעייפות יתר. בד”כ ארוחות משותפות נעשות בערבים. אם הילד כבר עייף בזמן הארוחה זה מייצר תסכול ולרוב לא נצליח לייצר שיתוף פעולה. אם הארוחה בבית מתרחשת בבית ובשליטתם בשעה – הקדימו! אם נעשית במקום אחר, תנו לילד זמן מנוחה לפני כן ואפשרו לילד לסיים את האוכל ולהתפנות מהשולחן כשמסיים.",
        ],
        desc: "מקווה שעזרתי. מה עובד לכם? ספרו לי, זה ממש מעניין אותי!"
    }

    return (
        <div className="py-12 lg:py-20 space-y-12">
            <div className="w-full">
                <img className="w-full" src="/assets/images/article/article-1.png" alt="/public/assets/images/article/article-1.png" />
            </div>
            <div className="max-w-3xl mx-auto ">
                <p className="text-app-black text-lg">{postDesc}</p>
            </div>
            <div className="max-w-3xl mx-auto space-y-6">
                <h1 className="text-3xl font-bold text-app-brown">{list.title}</h1>
                <ul className="space-y-8 list list-disc list-outside mx-4">
                    {list.items.map((e, i) =>
                        <li className="text-app-black text-lg" key={i}>{e}</li>
                    )}
                </ul>
                <p className="text-app-black text-lg">{list.desc}</p>
            </div>
        </div >
    );
}
